Tekla Open API Reference for Tekla Structures 2025
Integer Methods
The Integer type exposes the following members.
Methods
Name | Description
Equals
 Returns a value that indicates whether the current instance is equal to the given object.
 (Overrides ValueType.Equals(Object).)
GetHashCode
 Returns the hash code for the current instance.
 (Overrides ValueType.GetHashCode().)
GetSchema
 Gets the XML Schema for the datatype.
ReadXml
 Parses a new value from the given reader.
ToString
 Returns the string representation of the object.
 (Overrides ValueType.ToString().)
WriteXml
 Writes the value as XML to the given writer.
Top
See Also
Reference
Integer Structure
Tekla.Structures.Datatype Namespace